/*********************************************************************************************************************
* 文件名            cpu1_main.c
* 说明              副核入口。自测工程全部在 CPU0 上跑，副核保持空转就行
********************************************************************************************************************/
#include "zf_common_headfile.h"

#pragma section all "cpu1_dsram"

// **************************** 代码区域 ****************************
void core1_main(void)
{
    disable_Watchdog();                             // 关闭看门狗
    interrupt_global_enable(0);                     // 打开全局中断

    cpu_wait_event_ready();                         // 等待所有核心初始化完毕

    while(TRUE)
    {
    }
}
#pragma section all restore
// **************************** 代码区域 ****************************
